{
    "personalInfo": {
        "name": "Gabriel Ramos de Sousa",
        "email": "gabrielramos.email@gmail.com",
        "phone": "+55 32 9 9139-5135",
        "github": "https://github.com/GabrielDSousa",
        "linkedin": "https://www.linkedin.com/in/GabrielDSousa/",
        "location": "Juiz de Fora, MG, Brazil"
    },
    "professionalSummary": {
        "title": "Full-Stack PHP Developer",
        "summary": "Results-driven PHP Full-Stack Developer with almost 4 years of expertise in crafting efficient applications and APIs. Proven track record in collaborative team environments, delivering user-focused solutions on time and within scope."
    },
    "workExperience": [
        {
            "company": "SoftExpert",
            "companyDescription": "A market-leading enterprise specializing in integrated compliance management solutions.",
            "location": "Remote, Brazil",
            "title": "Full Stack PHP Developer",
            "date": "04/2023 - 12/2023",
            "description": "Contributed to advancing a new platform iteration.",
            "milestones": [
                "Engineered and implemented customized system modifications for 8 key clients, resulting in a 7% increase in overall client satisfaction.",
                "Developed Restful APIs for a unified notification system, encompassing SMS, email, and platform integration.",
                "Led migration of legacy systems to a modern React interface, improving page load times by 15%.",
                "Conducted proactive maintenance tasks, ensuring a 7% decrease in reported issues.",
                "Collaborated with multidisciplinary teams, resulting in a 30% faster implementation of client-requested features.",
                "Participated in a Hackathon, achieving a 50% completion milestone for innovative tools slated for implementation in the upcoming version."
            ]
        },
        {
            "company": "DomvsIt",
            "companyDescription": "A global IT consulting & software solutions company.",
            "location": "Remote, Brazil",
            "title": "Full Stack PHP Developer",
            "date": "07/2022 - 12/2022",
            "description": "Contributed to moving a new version of the platform forward.",
            "milestones": [
                "Developed and maintained a web application for the Finnet fintech client, resulting in a 12% increase in user engagement.",
                "Collaborated on upgrading the SMS delivery platform, achieving a 20% increase in SMS delivery success rates.",
                "Successfully addressed a high-priority bug causing payment reminder delays, resulting in an 80% reduction in customer complaints.",
                "Implemented policy change alerts using Vue.js, leading to a 45% increase in user awareness.",
                "Integrated an API-driven customer service chatbot, resulting in a 20% reduction in customer support inquiries.",
                "Strengthened server security with more stringent CORS rules, decreasing security-related incidents by 5%."
            ]
        },
        {
            "company": "Printi",
            "companyDescription": "A Brazilian e-commerce company that offers printing services.",
            "location": "Remote, Brazil",
            "title": "Junior Full Stack PHP Developer",
            "date": "03/2022 - 06/2022",
            "description": "Contributed to enhancing system responsiveness and robustness.",
            "milestones" : [
                "Improved system stability and reliability, increasing unit test coverage by 17% within the first quarter.",
                "Fostered a collaborative development environment, organizing global programming sessions for cross-team knowledge sharing.",
                "Deployed and integrated a notification system for newly added designs, resulting in a 7% increase in customer satisfaction."
            ]
        },
        {
            "company": "Reportei",
            "companyDescription": "A Brazilian startup that offers a social media reporting tool.",
            "location": "Remote, Brazil",
            "title": "Junior Full Stack PHP Developer",
            "date": "01/2021 - 03/2022",
            "description": "Played a key role in the development of new features and maintenance of the SaaS product.",
            "milestones": [
                "Implemented new features for the personalized marketing reports web application, resulting in a 7% increase in user engagement.",
                "Crafted payment pages using Laravel, Blade, and Livewire, resulting in a 22% improvement in transaction success rates.",
                "Spearheaded an exit intent project using Javascript, contributing to a 7% increase in client retention.",
                "Addressed reactivity issues on dynamic report pages by employing Vue.js, resulting in an 8% reduction in page load times.",
                "Optimized the report generation process, resulting in a 12% reduction in report generation time.",
                "Collaborated with the team to implement performance improvements across the entire database. This resulted in a 15% reduction in database query times."
            ]
        },
        {
            "company": "App Masters",
            "companyDescription": "A Brazilian local startup that offers IT consulting & software solutions.",
            "location": "Juiz de Fora, MG, Brazil",
            "title": "Back-end PHP internship",
            "date": "08/2018 - 10/2018",
            "description": "Played a key role in the initial development of a new product.",
            "milestones": [
                "Led the development of a comprehensive RESTful API for a website creation platform, utilizing Lumen and MySQL.",
                "Implemented the adoption of Test-Driven Development (TDD) principles using PHPUnit, at new features development.",
                "Adopted the version control in project, using Git, facilitating collaborative development and maintaining a well-organized code repository."
            ]
        },
        {
            "company": "Voitto Group",
            "companyDescription": "A Brazilian local company that offers online courses and consulting services about Lean Six Sigma.",
            "location": "Juiz de Fora, MG, Brazil",
            "title": "Full Stack PHP internship",
            "date": "03/2018 - 07/2018",
            "description": "Developed new features and provided maintenance for the course website.",
            "milestones": [
                "Proactively addressed and resolved customer-reported bugs on the Lean Six Sigma management courses video platform.",
                "Collaborated with the research team to innovate and implement a gamification system tied to course completion time.",
                "Leveraged the Codeigniter framework to construct and optimize the video platform for Lean Six Sigma management courses."
            ]
        }
    ],
    "education": [
        {
            "institution": "Vianna Júnior",
            "location": "Juiz de Fora, MG, Brazil",
            "degree": "Technologist in Systems for Internet",
            "date": "2016 - 2018",
            "description": "Relevant coursework: Data Structures, Algorithms, Object-Oriented Programming, Software Engineering, Database Management Systems, Computer Networks, Operating Systems, Agile management and Webapps."
        }
    ],
    "certifications": [
        {
            "institution": "Udemy",
            "location": "Online",
            "title": "PHP 7 Completo - Curso do Desenvolvedor Web 2021 + Projetos",
            "date": "2021",
            "description": "Learned the fundamentals of PHP 7 and MySQL, including basic syntax, OOP, and database management."
        }
    ],
    "skills": {
        "languages": [
            "PHP",
            "Javascript",
            "HTML",
            "CSS"
        ],
        "frameworks": [
            "Laravel",
            "Lumen",
            "Codeigniter",
            "Symfony",
            "Vue.js",
            "React",
            "Bootstrap",
            "Tailwind CSS"
        ],
        "databases": [
            "MySQL",
            "PostgreSQL",
            "MongoDB",
            "SQL Server"
        ],
        "tools": [
            "Git",
            "Docker",
            "Linux",
            "Apache",
            "Nginx",
            "PHPUnit",
            "Composer",
            "NPM"
        ],
        "languagesLevel": {
            "portuguese": "Native",
            "english": "B2 - Upper Intermediate"
        },
        "interests": [
            "Software Architecture",
            "Software Design Patterns",
            "Clean Code",
            "Test-Driven Development",
            "Continuous Integration",
            "Continuous Delivery",
            "Continuous Deployment",
            "Microservices",
            "Event-Driven Architecture",
            "Serverless Architecture",
            "Cloud Computing",
            "Machine Learning",
            "Artificial Intelligence",
            "Internet of Things"
        ], 
        "achievements": [
            "Participated in the October 2023 SoftExpert Hackathon, achieving a 50% completion milestone for innovative tools slated for implementation in the upcoming version.",
            "Participated in the January 2018 Vianna Hackathon, achieving a 75% completion milestone for the problems making my team the second place."
        ]
    }
}
